## Staging: ecs
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 21 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                                              NAME                                                              |
|--------|--------------------------------------------------------------------------------------------------------------------------------|
| add    | `aws_cloudwatch_log_group.feedback_cronjob`                                                                                    |
|        | `aws_cloudwatch_log_stream.feedback_cronjob`                                                                                   |
|        | `aws_security_group.ecs_tasks`                                                                                                 |
|        | `aws_security_group_rule.ecs_egress_all`                                                                                       |
|        | `module.feedback_cronjob.aws_cloudwatch_log_group.this`                                                                        |
|        | `module.feedback_cronjob.aws_cloudwatch_log_subscription_filter.this_sentinel_forwarder[0]`                                    |
|        | `module.feedback_cronjob.aws_ecs_cluster.this[0]`                                                                              |
|        | `module.feedback_cronjob.aws_ecs_cluster_capacity_providers.this[0]`                                                           |
|        | `module.feedback_cronjob.aws_ecs_service.this`                                                                                 |
|        | `module.feedback_cronjob.aws_ecs_task_definition.this`                                                                         |
|        | `module.feedback_cronjob.aws_iam_policy.this_task_exec`                                                                        |
|        | `module.feedback_cronjob.aws_iam_role.this_task`                                                                               |
|        | `module.feedback_cronjob.aws_iam_role.this_task_exec`                                                                          |
|        | `module.feedback_cronjob.aws_iam_role_policy_attachment.this_task_exec`                                                        |
|        | `module.feedback_cronjob.module.sentinel_forwarder[0].aws_cloudwatch_log_group.sentinel_forwarder_lambda`                      |
|        | `module.feedback_cronjob.module.sentinel_forwarder[0].aws_iam_policy.sentinel_forwarder_lambda`                                |
|        | `module.feedback_cronjob.module.sentinel_forwarder[0].aws_iam_role.sentinel_forwarder_lambda`                                  |
|        | `module.feedback_cronjob.module.sentinel_forwarder[0].aws_iam_role_policy_attachment.sentinel_forwarder_lambda`                |
|        | `module.feedback_cronjob.module.sentinel_forwarder[0].aws_lambda_function.sentinel_forwarder`                                  |
|        | `module.feedback_cronjob.module.sentinel_forwarder[0].aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[0]` |
|        | `module.feedback_cronjob.module.sentinel_forwarder[0].aws_ssm_parameter.sentinel_forwarder_auth`                               |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.feedback_cronjob will be created
  + resource "aws_cloudwatch_log_group" "feedback_cronjob" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/ecs/feedback-cronjob-cluster"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags_all          = {
          + "CostCentre" = "feedback-cronjob-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_cloudwatch_log_stream.feedback_cronjob will be created
  + resource "aws_cloudwatch_log_stream" "feedback_cronjob" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + log_group_name = "/aws/ecs/feedback-cronjob-cluster"
      + name           = "feedback-cronjob-log-stream"
    }

  # aws_security_group.ecs_tasks will be created
  + resource "aws_security_group" "ecs_tasks" {
      + arn                    = (known after apply)
      + description            = "Security group for feedback cronjob ECS tasks"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "feedback-cronjob-ecs-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCentre" = "feedback-cronjob-staging"
        }
      + tags_all               = {
          + "CostCentre" = "feedback-cronjob-staging"
          + "Terraform"  = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group_rule.ecs_egress_all will be created
  + resource "aws_security_group_rule" "ecs_egress_all" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow ECS tasks to make outbound API calls"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.feedback_cronjob.data.aws_ecs_task_definition.this_latest will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecs_task_definition" "this_latest" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = (known after apply)
      + enable_fault_injection   = (known after apply)
      + ephemeral_storage        = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = (known after apply)
      + id                       = (known after apply)
      + inference_accelerator    = (known after apply)
      + ipc_mode                 = (known after apply)
      + memory                   = (known after apply)
      + network_mode             = (known after apply)
      + pid_mode                 = (known after apply)
      + placement_constraints    = (known after apply)
      + proxy_configuration      = (known after apply)
      + requires_compatibilities = (known after apply)
      + revision                 = (known after apply)
      + runtime_platform         = (known after apply)
      + status                   = (known after apply)
      + task_definition          = "feedback-cronjob-task"
      + task_role_arn            = (known after apply)
      + volume                   = (known after apply)
    }

  # module.feedback_cronjob.data.aws_iam_policy_document.this_task_exec_combined will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this_task_exec_combined" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + minified_json           = (known after apply)
      + source_policy_documents = [
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "ecr:GetDownloadUrlForLayer",
                              + "ecr:GetAuthorizationToken",
                              + "ecr:BatchGetImage",
                              + "ecr:BatchCheckLayerAvailability",
                            ]
                          + Effect   = "Allow"
                          + Resource = "*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + (known after apply),
        ]
    }

  # module.feedback_cronjob.data.aws_iam_policy_document.this_task_exec_logs will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this_task_exec_logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:DescribeLogGroups",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:DescribeLogStreams",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.feedback_cronjob.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/ecs/feedback-cronjob-cluster/feedback-cronjob-task-service"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "CostCentre" = "feedback-cronjob-staging"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "feedback-cronjob-staging"
          + "Terraform"  = "true"
        }
    }

  # module.feedback_cronjob.aws_cloudwatch_log_subscription_filter.this_sentinel_forwarder[0] will be created
  + resource "aws_cloudwatch_log_subscription_filter" "this_sentinel_forwarder" {
      + destination_arn = (known after apply)
      + distribution    = "Random"
      + filter_pattern  = "[w1=\"*\"]"
      + id              = (known after apply)
      + log_group_name  = "/aws/ecs/feedback-cronjob-cluster/feedback-cronjob-task-service"
      + name            = "All cluster logs"
      + role_arn        = (known after apply)
    }

  # module.feedback_cronjob.aws_ecs_cluster.this[0] will be created
  + resource "aws_ecs_cluster" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "feedback-cronjob-cluster"
      + tags     = {
          + "CostCentre" = "feedback-cronjob-staging"
          + "Terraform"  = "true"
        }
      + tags_all = {
          + "CostCentre" = "feedback-cronjob-staging"
          + "Terraform"  = "true"
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # module.feedback_cronjob.aws_ecs_cluster_capacity_providers.this[0] will be created
  + resource "aws_ecs_cluster_capacity_providers" "this" {
      + capacity_providers = [
          + "FARGATE",
        ]
      + cluster_name       = "feedback-cronjob-cluster"
      + id                 = (known after apply)

      + default_capacity_provider_strategy {
          + base              = 1
          + capacity_provider = "FARGATE"
          + weight            = 1
        }
    }

  # module.feedback_cronjob.aws_ecs_service.this will be created
  + resource "aws_ecs_service" "this" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = "feedback-cronjob-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 50
      + desired_count                      = 0
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = true
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "feedback-cronjob-task-service"
      + platform_version                   = "LATEST"
      + propagate_tags                     = "SERVICE"
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "CostCentre" = "feedback-cronjob-staging"
          + "Terraform"  = "true"
        }
      + tags_all                           = {
          + "CostCentre" = "feedback-cronjob-staging"
          + "Terraform"  = "true"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + deployment_controller {
          + type = "ECS"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = [
              + null,
            ]
        }
    }

  # module.feedback_cronjob.aws_ecs_task_definition.this will be created
  + resource "aws_ecs_task_definition" "this" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + environment            = [
                      + {
                          + name  = "AIRTABLE_ML_TAGS"
                          + value = "ML Tags"
                        },
                      + {
                          + name  = "AIRTABLE_PAGE_TITLE_LOOKUP"
                          + value = "Page feedback statistics"
                        },
                      + {
                          + name  = "AIRTABLE_TAB"
                          + value = "Page feedback"
                        },
                      + {
                          + name  = "AIRTABLE_URL_LINK"
                          + value = "Page groups by URL"
                        },
                    ]
                  + essential              = true
                  + image                  = ":latest"
                  + logConfiguration       = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/aws/ecs/feedback-cronjob-cluster/feedback-cronjob-task-service"
                          + awslogs-region        = "ca-central-1"
                          + awslogs-stream-prefix = "task"
                        }
                    }
                  + mountPoints            = []
                  + name                   = "feedback-cronjob"
                  + readonlyRootFilesystem = false
                  + secrets                = [
                      + {
                          + name      = "AIRTABLE_BASE"
                          + valueFrom = ""
                        },
                      + {
                          + name      = "AIRTABLE_KEY"
                          + valueFrom = ""
                        },
                      + {
                          + name      = "CRA_AIRTABLE_BASE"
                          + valueFrom = ""
                        },
                      + {
                          + name      = "GOOGLE_SERVICE_ACCOUNT_KEY"
                          + valueFrom = ""
                        },
                      + {
                          + name      = "HEALTH_AIRTABLE_BASE"
                          + valueFrom = ""
                        },
                      + {
                          + name      = "IRCC_AIRTABLE_BASE"
                          + valueFrom = ""
                        },
                      + {
                          + name      = "SPRING_DATA_MONGODB_URI"
                          + valueFrom = ""
                        },
                      + {
                          + name      = "TRAVEL_AIRTABLE_BASE"
                          + valueFrom = ""
                        },
                    ]
                  + systemControls         = []
                  + ulimits                = [
                      + {
                          + hardLimit = 65536
                          + name      = "nofile"
                          + softLimit = 65536
                        },
                    ]
                  + volumesFrom            = []
                },
            ]
        )
      + cpu                      = "2048"
      + enable_fault_injection   = (known after apply)
      + family                   = "feedback-cronjob-task"
      + id                       = (known after apply)
      + memory                   = "4096"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "CostCentre" = "feedback-cronjob-staging"
          + "Terraform"  = "true"
        }
      + tags_all                 = {
          + "CostCentre" = "feedback-cronjob-staging"
          + "Terraform"  = "true"
        }
      + track_latest             = false
        # (2 unchanged attributes hidden)

      + runtime_platform {
          + cpu_architecture        = "X86_64"
          + operating_system_family = "LINUX"
        }
    }

  # module.feedback_cronjob.aws_iam_policy.this_task_exec will be created
  + resource "aws_iam_policy" "this_task_exec" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "feedback-cronjob-task_ecs_task_exec_policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "CostCentre" = "feedback-cronjob-staging"
          + "Terraform"  = "true"
        }
      + tags_all         = {
          + "CostCentre" = "feedback-cronjob-staging"
          + "Terraform"  = "true"
        }
    }

  # module.feedback_cronjob.aws_iam_role.this_task will be created
  + resource "aws_iam_role" "this_task" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "feedback-cronjob-task_ecs_task_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "feedback-cronjob-staging"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "feedback-cronjob-staging"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.feedback_cronjob.aws_iam_role.this_task_exec will be created
  + resource "aws_iam_role" "this_task_exec" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "feedback-cronjob-task_ecs_task_exec_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "feedback-cronjob-staging"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "feedback-cronjob-staging"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.feedback_cronjob.aws_iam_role_policy_attachment.this_task_exec will be created
  + resource "aws_iam_role_policy_attachment" "this_task_exec" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "feedback-cronjob-task_ecs_task_exec_role"
    }

  # module.feedback_cronjob.module.sentinel_forwarder[0].data.aws_iam_policy_document.sentinel_forwarder_lambda will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "sentinel_forwarder_lambda" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "xray:GetSamplingRules",
              + "xray:GetSamplingStatisticSummaries",
              + "xray:GetSamplingTargets",
              + "xray:PutTelemetryRecords",
              + "xray:PutTraceSegments",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ssm:GetParameter",
              + "ssm:GetParameters",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.feedback_cronjob.module.sentinel_forwarder[0].aws_cloudwatch_log_group.sentinel_forwarder_lambda will be created
  + resource "aws_cloudwatch_log_group" "sentinel_forwarder_lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/feedback-cronjob-cluster"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags              = {
          + "CostCentre" = "feedback-cronjob-staging"
        }
      + tags_all          = {
          + "CostCentre" = "feedback-cronjob-staging"
          + "Terraform"  = "true"
        }
    }

  # module.feedback_cronjob.module.sentinel_forwarder[0].aws_iam_policy.sentinel_forwarder_lambda will be created
  + resource "aws_iam_policy" "sentinel_forwarder_lambda" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "SentinelForwarderLambda-feedback-cronjob-cluster"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = {
          + "CostCentre" = "feedback-cronjob-staging"
          + "Terraform"  = "true"
        }
    }

  # module.feedback_cronjob.module.sentinel_forwarder[0].aws_iam_role.sentinel_forwarder_lambda will be created
  + resource "aws_iam_role" "sentinel_forwarder_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "SentinelForwarderLambda-feedback-cronjob-cluster"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "CostCentre" = "feedback-cronjob-staging"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.feedback_cronjob.module.sentinel_forwarder[0].aws_iam_role_policy_attachment.sentinel_forwarder_lambda will be created
  + resource "aws_iam_role_policy_attachment" "sentinel_forwarder_lambda" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "SentinelForwarderLambda-feedback-cronjob-cluster"
    }

  # module.feedback_cronjob.module.sentinel_forwarder[0].aws_lambda_function.sentinel_forwarder will be created
  + resource "aws_lambda_function" "sentinel_forwarder" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Lambda function to forward AWS logs to Azure Sentinel"
      + filename                       = "/tmp/sentinel_forwarder.py.zip"
      + function_name                  = "feedback-cronjob-cluster"
      + handler                        = "sentinel_forwarder.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:ca-central-1:283582579564:layer:aws-sentinel-connector-layer:199",
        ]
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "mfdZfYUgPWLo+yh9aU8f33p2Tg+J0YOaJr3kKgPNVhE="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "feedback-cronjob-staging"
        }
      + tags_all                       = {
          + "CostCentre" = "feedback-cronjob-staging"
          + "Terraform"  = "true"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config {
          + mode = "Active"
        }
    }

  # module.feedback_cronjob.module.sentinel_forwarder[0].aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[0] will be created
  + resource "aws_lambda_permission" "sentinel_forwarder_cloudwatch_log_subscription" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "feedback-cronjob-cluster"
      + id                  = (known after apply)
      + principal           = "logs.ca-central-1.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromCloudWatchLogs-feedback-cronjob-cluster-0"
      + statement_id_prefix = (known after apply)
    }

  # module.feedback_cronjob.module.sentinel_forwarder[0].aws_ssm_parameter.sentinel_forwarder_auth will be created
  + resource "aws_ssm_parameter" "sentinel_forwarder_auth" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "feedback-cronjob-cluster-auth"
      + tags           = {
          + "CostCentre" = "feedback-cronjob-staging"
        }
      + tags_all       = {
          + "CostCentre" = "feedback-cronjob-staging"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

Plan: 21 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cluster_arn                 = (known after apply)
  + ecs_tasks_security_group_id = (known after apply)
  + task_definition_arn         = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.feedback_cronjob"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.ecs_tasks"]
WARN - plan.json - main - Missing Common Tags: ["module.feedback_cronjob.module.sentinel_forwarder[0].aws_cloudwatch_log_group.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.feedback_cronjob.module.sentinel_forwarder[0].aws_iam_policy.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.feedback_cronjob.module.sentinel_forwarder[0].aws_iam_role.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.feedback_cronjob.module.sentinel_forwarder[0].aws_lambda_function.sentinel_forwarder"]
WARN - plan.json - main - Missing Common Tags: ["module.feedback_cronjob.module.sentinel_forwarder[0].aws_ssm_parameter.sentinel_forwarder_auth"]

26 tests, 19 passed, 7 warnings, 0 failures, 0 exceptions

```

</details>
